results/sweep-20260817-015539/bench-c8.log

Throughput
note: saving the result JSON to /root/inference-poc/results/sweep-20260817-015539/result-c8.json
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x767ba0bb4540>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='localhost', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='deepseek-ai/DeepSeek-V4-Pro-0813', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/root/inference-poc/results/sweep-20260817-015539/result-c8.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-f6509c7e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 02:00:51 [config.py:774] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 08-17 02:00:52 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 64/64 [01:23<00:00,  1.30s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  83.30     
Total input tokens:                      131328    
Total generated tokens:                  32768     
Request throughput (req/s):              0.77      
Output token throughput (tok/s):         393.35    
Peak output token throughput (tok/s):    237.00    
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          1969.83   
---------------Time to First Token----------------
Mean TTFT (ms):                          772.80    
Median TTFT (ms):                        314.09    
P99 TTFT (ms):                           5634.85   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.72     
Median TPOT (ms):                        17.91     
P99 TPOT (ms):                           29.12     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.02     
Median ITL (ms):                         34.51     
P99 ITL (ms):                            248.42    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9828.78   
Median E2EL (ms):                        9614.97   
P99 E2EL (ms):                           16461.85  
---------------Speculative Decoding---------------
Acceptance rate (%):                     19.16     
Acceptance length:                       2.34      
Drafts:                                  14017     
Draft tokens:                            98119     
Accepted tokens:                         18795     
Per-position acceptance (%):
  Position 0:                            54.08     
  Position 1:                            31.16     
  Position 2:                            19.23     
  Position 3:                            12.51     
  Position 4:                            8.65      
  Position 5:                            5.46      
  Position 6:                            2.99      
==================================================